Repository: brightening-eyes/extream-download-manager
Catalog: locale/*/LC_MESSAGES/*.po
Languages: ar

source: en
ar: english

source: fa
ar: پارسی

source: de
ar: Deutsche

source: ar
ar: العربية

source: cancel
ar: أِلغاء

source: start download
ar: بدء التحميل

source: add new download
ar: أضافة تحميل جديد

source: exit
ar: الخروج من البرنامَجْ

source: to start a download, select Add New Download from the file menu
ar: لِإِضافة تحميل جديد اختر إِضافة تحميل جديد من القائمة

source: enter download link here
ar: ادخل رابط التحميل هنا

source: where should this file be saved to?
ar: أَيْن تُريد حِفْظ هذا المِلَف؟

source: wrong protocol set. Supported protocols are http* and ftp
ar: تم ادخال بروتوكول خاطئ البروتوكولات المدعومة هي http* و ftp الرجاء ادخال بروتوكول صحيح ومن ثم اعادة المحاولة

source: wrong download link set
ar: لا يمكن التحميل من هذا الرابط الرجاء ادخال رابط صحيح ومن ثم اعادة المحاولة

source: not yet began downloading
ar: لم يتم بدء التحميل بَعْد

source: remaining
ar: المتبقي

source: info
ar: معلومات

source: state
ar: الحالة

source: download progress
ar: شريط التقدم

source: estimated time remaining
ar: الوقت المتبقي

source: transfer rate
ar: حجم الذي تم تحميله

source: file size
ar: حجم الملف كاملاً

source: status
ar: الحالة

source: error
ar: خَطَأْ

source: download completed successfully. The file saved in
ar: تم التحميل بنجاح وقد تم حفظ الملف في

source: download complete
ar: ملف

source: downloading
ar: جاري التحميل

source: paused
ar: تم الإنتهاء

source: pause
ar: أيقاف مُؤَّقَت

source: resume
ar: إستكمال التحميل

source: select language
ar: أِخْتَرْ اللُغة

source: select a language
ar: إِخْتَر لغة البرنامج

source: change language
ar: تغيير اللغة

source: download info
ar: معلومات التحميل
